In [ ]:
import sqlite3
import pandas as pd
conn = sqlite3.connect(r'./public.db')
def rsq(sql):
    return pd.read_sql(sql, conn)

In [ ]:
rsq("""-- Select the university_shortname column
SELECT DISTINCT(university_shortname)
FROM professors;""")

   university_shortname
0                   EPF
1                   ETH
2                   UBE
3                   ULA
4                   USG
5                   UNE
6                   UFR
7                   USI
8                   UBA
9                   UGE
10                  UZH

In [ ]:
rsq("""ALTER TABLE professors
ALTER COLUMN university_shortname
TYPE char(3);""")

DatabaseError: Execution failed on sql 'ALTER TABLE professors
ALTER COLUMN university_shortname
TYPE char(3);': near "ALTER": syntax error

In [ ]:
rsq("""-- Change the type of firstname
ALTER TABLE professors
ALTER COLUMN firstname
TYPE varchar(64);""")

DatabaseError: Execution failed on sql '-- Change the type of firstname
ALTER TABLE professors
ALTER COLUMN firstname
TYPE varchar(64);': near "ALTER": syntax error

In [ ]:
print(rsq("""-- Query the right table in information_schema

-- Specify the correct table_schema value
SELECT * 
FROM sqlite_master """)['sql'].values[2])

CREATE TABLE professors (
    id INTEGER PRIMARY KEY,
    firstname TEXT,
    lastname TEXT,
    university TEXT,
    department TEXT,
    age INTEGER
, university_shortname TEXT)

In [ ]:
ALTER TABLE professors
ALTER COLUMN firstname
TYPE varchar(16)
USING SUBSTRING(firstname FROM 1 FOR 16)

In [ ]:
-- Disallow NULL values in firstname
ALTER TABLE professors
ALTER COLUMN firstname SET NOT NULL;
#  Add a not-null constraint for the lastname column.
-- Disallow NULL values in lastname
ALTER TABLE professors
ALTER COLUMN lastname SET NOT NULL

In [ ]:
-- Add the new column to the table
ALTER TABLE professors
ADD COLUMN id serial;

-- Make id a primary key
ALTER TABLE professors
ADD CONSTRAINT professors_pkey PRIMARY KEY (id);

-- Have a look at the first 10 rows of professors
SELECT * FROM professors LIMIT 10;

In [ ]:
rsq("""CREATE TABLE cars (
 make varchar(64) NOT NULL,
 model varchar(64) NOT NULL,
 mpg integer NOT NULL
)""")

TypeError: 'NoneType' object is not iterable

In [ ]:
# df = pd.read_clipboard()
# df.to_sql('cars', conn, index=False, if_exists='replace')

10

In [ ]:
SELECT COUNT(DISTINCT(make, model))
FROM cars;

In [ ]:
rsq("""
SELECT COUNT(DISTINCT make || model)
FROM cars;
""")

   COUNT(DISTINCT make || model)
0                             10

In [ ]:
-- Count the number of distinct rows with columns make, model
SELECT COUNT(DISTINCT(make, model))
FROM cars;

-- Add the id column
ALTER TABLE cars
ADD COLUMN id varchar(128);

-- Update id with make + model
UPDATE cars
SET id = CONCAT(make, model);

In [ ]:
rsq("""-- Add the id column
ALTER TABLE cars
ADD COLUMN id varchar(128);""")

TypeError: 'NoneType' object is not iterable

In [ ]:
rsq("""
-- Update id with make + model
UPDATE cars
SET id = make || model;
""")

TypeError: 'NoneType' object is not iterable

In [ ]:
rsq(""" select * from cars """)

         make      model  mpg                  id
0      Subaru   Forester   24      SubaruForester
1        Opel      Astra   45           OpelAstra
2        Opel     Vectra   40          OpelVectra
3        Ford    Avenger   30         FordAvenger
4        Ford     Galaxy   30          FordGalaxy
5      Toyota      Prius   50         ToyotaPrius
6      Toyota  Speedster   30     ToyotaSpeedster
7      Toyota     Galaxy   20        ToyotaGalaxy
8  Mitsubishi   Forester   10  MitsubishiForester
9  Mitsubishi     Galaxy   30    MitsubishiGalaxy

In [ ]:
rsq("""-- Create the table
CREATE TABLE students (
  last_name varchar(128) NOT NULL,
  ssn integer PRIMARY KEY,
  phone_no char(12)
);""")

TypeError: 'NoneType' object is not iterable